using DZ2;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ConsoleApp10
{
    //Створіть клас Web.  У тілі класу Web створіть рядкове автовластивість WebColor зі значенням за замовчуванням
    //– «сірий», створіть метод ChangeWebColor(), який приймає рядки, що позначають кольори і змінює значення
    //WebColor відповідно до введеного значення. 
   // Створіть клас Spider.У тілі класу Spider створіть закрите поле типу Web, створіть метод SetWeb(), який
   //
   // очікує від користувача введення символу(char 'r', 'b', 'w', 'y').  Залежно від введеної літери, у цьому
   //
   // методі повинен викликатися метод ChangeWebColor() на полі Web, змінювати колір, що зберігається, на червоний, блакитний, білий або жовтий відповідно.Після цього в цьому ж методі SetWeb() повинен проводитися висновок на екран фрази: "Павутина {0} кольору".  Причому текст на екрані консолі повинен бути такого кольору, який зберігається в екземплярі Web(використовуйте конструкцію типу Console.ForegroundColor = ConsoleColor.Red;).  Після виведення тесту на екран поверніть текст консолі до стандартного(Console.ResetColor();).
 //Якщо метод SetWeb() надійшло значення, відмінне від очікуваного – користувачеві потрібно вивести на екран
 //консолі текст «Немає відповідного кольору у павутини».
 //Після виведення на екран значення програма повинна чекати наступного натискання 'r', 'b', 'w', 'y' або 'q'
 //(забезпечити вихід).
 //У методі Main створіть екземпляр класу Spider і викличте метод SetWeb().
    class Program
    {
        static void Main(string[] args)
        {
            Console.OutputEncoding = Encoding.Unicode;

            Spider spider = new Spider();
            
            spider.SetWeb();
           
            Console.ReadKey();
        }
    }
}




